In [1]:
import pandas as pd

In [2]:
# val=pd.read_csv("file:///D:\\Python\\Data Sets\\Financial Allocations.csv")

In [3]:
# val=val.head(20)
# val

***
# Merge

***==> It is used to Join two DataFrames***

==> **It adds data(new_cols) next to existing rows.**

==>**It only works when both data sets have atleast one same col_name.**

**==>merge(df1,df2,on="same_col")**
***

In [60]:
df1=pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})
df2=pd.DataFrame({"A":[1,2,3,4],"C":[15,26,37,48]})

***
# DataFrames with different orders

In [5]:
# pd.merge(df1,df2,on="A")

In [61]:
pd.merge(df1,df2)

   A  B   C
0  1  5  15
1  2  6  26
2  3  7  37
3  4  8  48

***
# DataFrames with different orders

In [7]:
val1=pd.DataFrame({"A":[1,2,3,4],"Name":["Ali","Hassan","Hussain","Hasnain"]})
val2=pd.DataFrame({"A":[1,2,4,5],"Age":[21,22,25,24]})

pd.merge(val1,val2)

   A     Name  Age
0  1      Ali   21
1  2   Hassan   22
2  4  Hasnain   25

**Merging with "how"**

***
***how with left***

In [8]:
print(val1)
print()
print(val2)
print()
print(pd.merge(val1,val2,how="left"))

   A     Name
0  1      Ali
1  2   Hassan
2  3  Hussain
3  4  Hasnain

   A  Age
0  1   21
1  2   22
2  4   25
3  5   24

   A     Name   Age
0  1      Ali  21.0
1  2   Hassan  22.0
2  3  Hussain   NaN
3  4  Hasnain  25.0

***
***how with right***

In [9]:
print(val1)
print()
print(val2)
print()
print(pd.merge(val1,val2,how="right"))

   A     Name
0  1      Ali
1  2   Hassan
2  3  Hussain
3  4  Hasnain

   A  Age
0  1   21
1  2   22
2  4   25
3  5   24

   A     Name  Age
0  1      Ali   21
1  2   Hassan   22
2  4  Hasnain   25
3  5      NaN   24

***
***how with outer***

In [10]:
print(val1)
print()
print(val2)
print()
print(pd.merge(val1,val2,how="outer"))

   A     Name
0  1      Ali
1  2   Hassan
2  3  Hussain
3  4  Hasnain

   A  Age
0  1   21
1  2   22
2  4   25
3  5   24

   A     Name   Age
0  1      Ali  21.0
1  2   Hassan  22.0
2  3  Hussain   NaN
3  4  Hasnain  25.0
4  5      NaN  24.0

***
Merging with indicator : 
***it lets us know about relation of data with dataframe***

In [14]:
print(pd.merge(val1,val2,how="outer",indicator=True))

   A     Name   Age      _merge
0  1      Ali  21.0        both
1  2   Hassan  22.0        both
2  3  Hussain   NaN   left_only
3  4  Hasnain  25.0        both
4  5      NaN  24.0  right_only

***
# Data sets with same Column_Names

In [39]:
df1=pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})
df2=pd.DataFrame({"A":[1,2,3,5],"B":[15,26,37,48]})

pd.merge(df1,df2,left_index=True,right_index=True)

   A_x  B_x  A_y  B_y
0    1    5    1   15
1    2    6    2   26
2    3    7    3   37
3    4    8    5   48

***
**Changing col_names**

In [19]:
pd.merge(df1,df2,left_index=True,right_index=True,suffixes=["_Id","_Val"])

   A_Id  B_Id  A_Val  B_Val
0     1     5      1     15
1     2     6      2     26
2     3     7      3     37
3     4     8      5     48

***

# Concat

==> **It is used to concatenate series/dataframe.**

==>**Also works when no same col_name.**

==>**pd.concat([sr_1,sr_2])**

***

In [63]:
sr1=pd.Series([1,2,3,4])
sr2=pd.Series([21,32,43,54])

print(sr1)
print()
print(sr2)

0    1
1    2
2    3
3    4
dtype: int64

0    21
1    32
2    43
3    54
dtype: int64

**Working with series**
***

In [33]:
pd.concat([sr1,sr2])

0     1
1     2
2     3
3     4
0    21
1    32
2    43
3    54
dtype: int64

**Working with DataFrames**
***

In [49]:
d1=pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})
d2=pd.DataFrame({"A":[1,2],"C":[15,26]})

In [50]:
pd.concat([d1,d2])

   A    B     C
0  1  5.0   NaN
1  2  6.0   NaN
2  3  7.0   NaN
3  4  8.0   NaN
0  1  NaN  15.0
1  2  NaN  26.0

***
**Using axis**

In [53]:
pd.concat([d1,d2],axis=1)

   A  B    A     C
0  1  5  1.0  15.0
1  2  6  2.0  26.0
2  3  7  NaN   NaN
3  4  8  NaN   NaN

***
**Only using intersected/union data**

In [55]:
pd.concat([d1,d2],axis=1,join="inner")

   A  B  A   C
0  1  5  1  15
1  2  6  2  26

***